Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.GetDataSchema
Obtains the schema of the ESEntity.
Returns:
Null if the server has no data.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.IsApplicable(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
Check if the server is applicable for the pipe fitting or pipe accessory.
data:
The input data of the calculation.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.Calculate(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
Calculate the pipe fitting and pipe accessory coefficient.
data:
The input and output data of the calculation.
Returns:
True if calculation succeeds.
False if calculation fails.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer
Interface class for external servers implementing pipe fitting and pipe accessory coefficient calculation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.Assign server to pipe fitting instance.
Since:
2014